# 문제: 프로그래머스 Lv.1 '최소직사각형'
# 설명: 명함 지갑을 만드는 회사에서 지갑의 크기를 정하려고 합니다. 다양한 모양과 크기의 명함들을 모두 수납할 수 있으면서, 작아서 들고 다니기 편한 지갑을 만들어야 합니다.
#       이러한 요건을 만족하는 지갑을 만들기 위해 디자인팀은 모든 명함의 가로 길이와 세로 길이를 조사했습니다.
#       아래 표는 4가지 명함의 가로 길이와 세로 길이를 나타냅니다.
#       가장 긴 가로 길이와 세로 길이가 각각 80, 70이기 때문에 80(가로) x 70(세로) 크기의 지갑을 만들면 모든 명함들을 수납할 수 있습니다.
#       하지만 2번 명함을 가로로 눕혀 수납한다면 80(가로) x 50(세로) 크기의 지갑으로 모든 명함들을 수납할 수 있습니다. 이때의 지갑 크기는 4000(=80 x 50)입니다.
#       모든 명함의 가로 길이와 세로 길이를 나타내는 2차원 배열 sizes가 매개변수로 주어집니다. 
#       모든 명함을 수납할 수 있는 가장 작은 지갑을 만들 때, 지갑의 크기를 return 하도록 solution 함수를 완성해주세요.
# 링크: https://school.programmers.co.kr/learn/courses/30/lessons/86491

# 풀이
# 1. 지갑의 최소 크기 계산을 위해 긴 변들의 최댓값(max_w)과 짧은 변들의 최댓값(max_h), 그리고 결과값(answer)을 0으로 초기화합니다.
# 2. for 반복문과 인덱스(i)를 사용해 모든 명함(sizes[i])을 하나씩 순회합니다.
# 3. 각 명함의 두 변 중 더 긴 길이는 w(max(sizes[i])), 더 짧은 길이는 h(min(sizes[i]))에 담아 명함의 방향을 한쪽으로 통일합니다.
# 4. 현재 명함의 w, h가 기존의 max_w, max_h보다 크거나 같으면 각각 최댓값을 갱신합니다.
# 5. 모든 명함 순회가 끝나면 갱신된 max_w와 max_h를 곱하여 answer에 저장한 뒤 반환합니다.

def solution(sizes):
    answer, max_w, max_h = 0, 0, 0
        
    #순서를 바꿔서, 맨 앞에는 둘 중 큰 수를, 그 뒤는 작은수를 가지는 2차원 배열로 다시 정렬하기.
    #그 중, 맨 앞에서의 가장 큰 값과, 뒤에서의 가장 큰 값을 각각 찾아내기.
    for i in range(len(sizes)):
        w = max(sizes[i])
        h = min(sizes[i])
        
        if w >= max_w:
            max_w = w
        if h >= max_h:
            max_h = h
        
    #찾아낸 맨 앞에서의 가장 큰 값과, 뒤에서의 가장 큰 값을 곱하여 반환하기.   
    answer = max_w * max_h
        
    return answer